Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F34C.tmx
Source language: en_us
Languages: zh_cn

source: 10 surprising facts about Ireland
zh_cn: 爱尔兰这个小绿岛鲜为人知的趣事

source: Technically, it is an offense to be drunk in public in Ireland.
zh_cn: 1、理论上，在爱尔兰酗酒是违法行为。

source: Regulations introduced last year allow the police to issue on-the-spot fines for anyone caught being drunk in a public place in Ireland.
zh_cn: 从理论上讲，在爱尔兰，在公开场合喝高了可是违法的。2008年起实行的新规定让警察可以对在公共场合酗酒的行为当场处以罚款。

source: An Irishman founded the Argentinean Navy
zh_cn: 2、阿根廷海军是一个爱尔兰人创建的。

source: Irishman William Brown (known in Spanish as "Guillermo Brown") is one of Argentina's national heroes. He is commonly known as the "father of the Argentine navy" and was an important leader in the Argentinean struggle for independence from Spain.
zh_cn: 爱尔兰人威廉·布朗（西班牙名叫“吉列尔莫·布朗”）是阿根廷的国家英雄，他有“阿根廷海军之父”的称号，为阿根廷从西班牙的统治下独立做出了重要贡献。

source: Brown's family left Foxford in Co. Mayo for Philadelphia in 1786 when he was aged 9 and his father died of yellow fever soon after they arrived in the U.S.
zh_cn: 威廉·布朗的家族1786年从爱尔兰梅奥郡的福克斯福德移民到了美国费城，他当时只有9岁，父亲在抵达美国不久后就患上黄热病去世了。

source: He led an adventurous early life: he fought in the Napoleonic wars, was taken prisoner-of-war, escaped to Germany, before somehow ending up in Uruguay, where he became a sea trader.
zh_cn: 于是布朗的早年生活充满冒险：他参加了拿破仑战争，被俘后逃到了德国，后来又作为一名海商出现在了南美的乌拉圭。

source: He then founded the Argentinean navy, when it was at war with Spain.
zh_cn: 在那之后，他建立了阿根廷海军，当时阿根廷正在与西班牙人作战。

source: Today there is a statute of Brown in his hometown of Foxford, Co. Mayo, which was unveiled in 2007, the 150th anniversary of his death.
zh_cn: 今天在他的故乡——梅奥郡福克斯福德建有他的雕像，它于2007年揭幕，也是为了纪念他逝世150周年。

source: In Argentina, there are 1,200 streets, 500 statues, two towns, one city and a few football clubs named after him.
zh_cn: 在阿根廷，有1200条街道、500座雕像、两座城镇、一个城市以及一个足球俱乐部以他的名字命名。

source: Only two members of U2 were born in Ireland
zh_cn: 3、爱尔兰的U2组合里，只有两位成员是在爱尔兰出生的。

source: David Howell Evans, more commonly known as The Edge, was born in London, to Welsh parents. Garvin and Gwenda Evans moved to Malahide in Dublin when The Edge was aged 1.
zh_cn: U2乐队的大卫·荷威·伊凡斯，以他的绰号“刀锋”知名，其实是在伦敦出生的，父亲贾文·伊凡斯和母亲葛雯达·伊凡斯都是威尔士人，他们在“刀锋”1岁时搬到了都柏林的马拉海德。

source: Adam Clayton, U2's bassist, was born in Oxfordshire, England. His family moved to Malahide in Dublin when he was 5, and he soon became friends with The Edge.
zh_cn: 而U2德贝斯手亚当·克莱顿是在英格兰的牛津郡出生的，他的父母在他5岁时恰巧也搬到了都柏林马拉海德，因此他与“刀锋”很快成为了好朋友。

source: Only Bono and Larry Mullen Jr. were actually born in Ireland.
zh_cn: U2中只有主唱博诺和鼓手小赖瑞·慕兰是真真正正在爱尔兰出生的。

source: The British Embassy in Tehran is on a street named after an Irishman
zh_cn: 4、英国驻伊朗大使馆所在的那条街是以一个爱尔兰人的名字命名的。

source: In 1981, shortly after the death of IRA hunger-striker Bobby Sands, the Iranian government changed the name of the street where the British Embassy is located from "Churchill Boulevard" (after the British Prime Minister) to "Bobby Sands Street."
zh_cn: 1981年，为了声援在爱尔兰共和军的反英绝食斗争中死去的鲍比·桑兹，伊朗政府把英国大使馆所在的街道从以英国首相命名的“丘吉尔大道”改成了“鲍比·桑兹街”。

source: British Embassy Staff were then forced to route everything through a side door in the building to avoid showing their address as The British Embassy, Bobby Sands Street, Tehran.
zh_cn: 英国使馆人员只好把所有的信件包裹转到侧门收发，以避免出现“英国大使馆，鲍比·桑兹街，德黑兰”的字样。

source: Up until around the early 1990s, Ireland had a low per capita consumption of alcohol
zh_cn: 5、截止到20世纪90年代初，爱尔兰人的人均酒类消费量其实是欧洲较低的。

source: When the word "Irish" comes up, "drinking" is never far behind.
zh_cn: 当说出“爱尔兰”这个词的时候，“酒”也就挂在嘴边了。

source: And today, Ireland alcohol's consumption is very high by international standards.
zh_cn: 今日爱尔兰的酒类消费水平位居全球领先地位。

source: A 2006 survey found that the Irish spend a higher proportion of their income on alcohol than anyone else in Europe. It also found that the Irish were the worst binge drinkers in Europe.
zh_cn: 一份2006年的调查表明，爱尔兰人的收入中用于酒类消费的比例是欧洲人中最高的，讽刺的是，爱尔兰人的酒量却是欧洲最差的。

source: So the recent evidence supports the old Irish drunkard stereotype.
zh_cn: 这也符合了刻板印象中把爱尔兰人比作醉鬼的描述。

source: But Ireland's alcohol consumption per population was moderate for much of the 20th century.
zh_cn: 然而，在20世纪的大多数年代里，爱尔兰人的人均酒类消费量并没有那么高。

source: There was a high level of alcohol abstinence in the country - something usually more associated with Protestantism - which was promoted by the Catholic Church.
zh_cn: 许多爱尔兰人选择戒酒，这是天主教会所鼓励的，虽然通常人们提到戒酒往往会联想到新教。

source: As the Church's moral authority declined, however, and as the country became wealthier, the Irish started to drink a lot more - finally earning themselves that old heavy-drinking stereotype.
zh_cn: 当教会的道德权威滑落、国家渐渐富裕的时候，爱尔兰人便开始敞开喝酒，这样才为他们带来了“老酒鬼”的刻板印象。

source: A Belfast hospital is a world leader in kneecap reconstruction
zh_cn: 6、贝尔法斯特的一家医院有着世界上最好的膝盖骨修复术。

source: During the Troubles, the Royal Victoria Hospital in Belfast had one of the top trauma units in Europe.
zh_cn: 在北爱尔兰动乱时期，贝尔法斯特的皇家维多利亚医院有着欧洲最好的创伤医疗队伍。

source: At one point as many as 100 victims of "limb executions" were being treated by the hospital every year, whose advances included external "limb scaffolding" that enables partial healing for bone damage too severe for reconstruction.
zh_cn: 每年多达100位被军事组织“断手断脚”的受害者在此医院接受治疗，接着发展出了“外部肢体搭建”的方法，使得那些骨头受创严重以至于不适合进行肢体修复的患者可以得到部分痊愈。
